<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7e572d7ec1f4326f20bd58cf491572731a6fea5494da2d18d9180b340a471c8c","plan_job_ref":"Job Create terraform plan #25 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6739010817","plan_hash":"f5c5ad620917a4e71ea88c48bec36f028866457255a4d82af140b73030ee9357","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c23b4640e351e15e00aed250e7cb46ea89cdeb47ac00526e05373f6a675ebd18.zip" -> "builds/7f4f62db8e4e0df045c50fc262ef48da7bb3ea2228e87cff6f244d060444efe2.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-31T05:59:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:16/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "16" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/7f4f62db8e4e0df045c50fc262ef48da7bb3ea2228e87cff6f244d060444efe2.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7f4f62db8e4e0df045c50fc262ef48da7bb3ea2228e87cff6f244d060444efe2.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*****************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c23b4640e351e15e00aed250e7cb46ea89cdeb47ac00526e05373f6a675ebd18.zip" -> "builds/7f4f62db8e4e0df045c50fc262ef48da7bb3ea2228e87cff6f244d060444efe2.zip"
          ~ "timestamp" = "1698731981144730000" -> "1698964852336052000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #25](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6739010817)